ToDos/capys/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    render json: Todo.all

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "strings"], ["body", "colon"], ["created_at", "2019-07-23 21:08:11.850054"], ["updated_at", "2019-07-23 21:08:11.850054"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save